[
  {
    "name": "Sam Manekshaw",
    "imageurl": "https://upload.wikimedia.org/wikipedia/commons/1/19/Field_marshal_SHFJ_Manekshaw.jpg",
    "summary": "Field Marshal Sam Hormusji Framji Jamshedji Manekshaw, MC (3 April 1914 – 27 June 2008), was the Chief of the Army Staff of the Indian Army during the Indo-Pakistani War of 1971, and the first Indian Army officer to be promoted to the rank of field marshal. His military career spanned four decades and five wars. Manekshaw rose to become the 8th Chief of the Army Staff of India in 1969 and under his command, Indian forces conducted a victorious campaign against Pakistan in 1971.",
    "events": {
      "Appointment as COAS": "In 1969, Manekshaw was appointed as the Chief of the Army Staff of the Indian Army.",
      "Role in 1971 Indo-Pak War": "He played a pivotal role in India's victory in the 1971 Indo-Pakistani War."
    }
  },
  {
    "name": "Arun Khetarpal",
    "imageurl": "https://starsunfolded.com/wp-content/uploads/2022/04/Second-Lieutenant-Arun-Khetarpal.jpg",
    "summary": "Second Lieutenant Arun Khetarpal, a brave officer of the Indian Army, posthumously received the Param Vir Chakra for his gallantry in the Battle of Basantar during the 1971 war.",
    "events": {
      "Battle of Basantar": "Displayed exceptional courage and leadership, destroying multiple enemy tanks before making the supreme sacrifice.",
      "Param Vir Chakra": "Received India's highest military decoration for his outstanding bravery."
    }
  },
  {
    "name": "Manoj Pandey",
    "imageurl": "https://i0.wp.com/news.biharprabha.com/wp-content/uploads/2013/07/Capt-Manoj-Kumar-Pandey.jpg?ssl=1",
    "summary": "Captain Manoj Kumar Pandey, an inspiring figure in the Indian Army, was posthumously awarded the Param Vir Chakra for his exceptional bravery during the Kargil War.",
    "events": {
      "Kargil War": "Led his team with unparalleled courage, capturing crucial enemy positions before sacrificing his life for the nation.",
      "Param Vir Chakra": "Honored with India's highest military award for his extraordinary valor."
    }
  },
  {
    "name": "Vikram Batra",
    "imageurl": "https://upload.wikimedia.org/wikipedia/en/5/56/Vikram_Batra_PVC.jpg",
    "summary": "Captain Vikram Batra, known as 'Sher Shah' among his comrades, was a valiant officer of the Indian Army during the Kargil War. His fearless actions and supreme sacrifice for the nation have made him a symbol of heroism and dedication.",
    "events": {
      "Capture of Point 5140": "Led his troops in the capture of Point 5140, displaying extraordinary bravery in the face of heavy enemy fire.",
      "Param Vir Chakra": "Posthumously awarded the Param Vir Chakra, India's highest military decoration, for his exemplary courage.",
      "Operation Vijay": "Played a crucial role in the success of Operation Vijay, contributing to the victory in the Kargil War.",
      "Legacy of Bravery": "His famous words, 'Yeh Dil Maange More!' (This heart craves more!), became a rallying cry for the nation."
    }
  },
  {
    "name": "Sarvepalli Radhakrishnan",
    "imageurl": "https://www.iloveindia.com/indian-heroes/pics/sarvepalli-radhakrishnan.jpg",
    "summary": "Lieutenant General Sarvepalli Radhakrishnan, a distinguished military officer, served in various capacities in the Indian Army, contributing significantly to the nation's defense and security.",
    "events": {
      "Indo-Pak Wars": "Participated in multiple Indo-Pak wars, showcasing strategic acumen and leadership skills.",
      "Peacekeeping Missions": "Led Indian military contingents in UN peacekeeping missions, contributing to global peace and security.",
      "Modernization Initiatives": "Played a key role in the modernization of the Indian Army, introducing new technologies and capabilities.",
      "National Security Leadership": "Served in pivotal roles in national security leadership, contributing to the formulation of defense policies."
    }
  },
  {
    "name": "Arun Kumar Vaidya",
    "imageurl": "https://upload.wikimedia.org/wikipedia/commons/1/1d/General_Arunkumar_Shridhar_Vaidya.jpg",
    "summary": "General Arun Kumar Vaidya, a distinguished officer of the Indian Army, served as the Chief of Army Staff during a critical period. His leadership was tested during Operation Blue Star, a military action to remove militants from the Golden Temple in Amritsar.",
    "events": {
      "Operation Blue Star": "Led the Indian Army during Operation Blue Star, a mission to remove militants from the Golden Temple complex.",
      "National Security Challenges": "Navigated the Indian Army through challenging times, addressing internal security threats.",
      "Chief of Army Staff": "Served as the Chief of Army Staff, contributing to the overall modernization and readiness of the Indian Army.",
      "Post-Retirement Contributions": "Remained engaged in security and strategic affairs, providing insights and guidance post-retirement."
    }
  },
  {
    "name": "Neelakanta Madhava Menon",
    "imageurl": "https://magarticles.magzter.com/articles/257/362293/5d417e8fdfaab/Legal-Luminary-Padma-Shri-Professor-Dr-NR-Madhava-Menon.jpg",
    "summary": "Major General Neelakanta Madhava Menon was a highly decorated officer in the Indian Army, known for his exceptional leadership and contributions to military education and training.",
    "events": {
      "Battlefield Leadership": "Demonstrated outstanding leadership in various battlefield scenarios, earning accolades for his strategic acumen.",
      "Military Education Reforms": "Initiated reforms in military education, contributing to the enhancement of training and curriculum development.",
      "Training Institutions": "Played a pivotal role in the establishment and management of military training institutions.",
      "Legacy in Education": "His legacy lives on through his contributions to military education, shaping future generations of military leaders."
    }
  },
  {
    "name": "Jaswant Singh",
    "imageurl": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcRhmVMy7Op0BypVX3OM5T5v3R3FYa7XjSEBkwbYIkXRHwpGsFSNqOVgfXewyFEryTvi4ig&usqp=CAU",
    "summary": "Lieutenant Colonel Jaswant Singh (3 January 1940 – 27 September 2020) was an Indian Army officer, politician, and author. Known for his courage during the 1965 Indo-Pak War, he later served in various political capacities. Singh's contributions to both the military and political spheres have left a lasting impact on the nation.",
    "events": {
      "1965 Indo-Pak War": "Showed exceptional bravery in the 1965 Indo-Pak War, earning the Maha Vir Chakra for his courage.",
      "Political Career": "Served in various political capacities, making significant contributions to national security and foreign affairs."
    }
  },
  {
    "name": "Subedar Yogendra Singh Yadav",
    "imageurl": "yogendra_singh_yadav_image.jpg",
    "summary": "Subedar Yogendra Singh Yadav, PVC, is a retired Indian Army soldier and a recipient of the Param Vir Chakra, India's highest military decoration. His indomitable spirit and bravery during the Kargil War, especially during the assault on Tiger Hill, have become legendary.",
    "events": {
      "Assault on Tiger Hill": "Led the assault on Tiger Hill, displaying exceptional courage and determination in the face of heavy enemy fire.",
      "Param Vir Chakra": "Awarded India's highest military decoration for his outstanding bravery."
    }
  },
  {
    "name": "Lance Naik Mohan Nath Goswami",
    "imageurl": "https://images.news18.com/ibnlive/uploads/2016/01/Mohan-Nath-Goswami.jpg.jpg?im=FitAndFill=(1200,675)",
    "summary": "Lance Naik Mohan Nath Goswami, PVC (10 November 1988 – 3 September 2015), was a soldier of the Indian Army's elite Para Special Forces. He was posthumously awarded the Param Vir Chakra for his exceptional courage and sacrifice during an anti-terrorist operation in Jammu and Kashmir.",
    "events": {
      "Anti-Terrorist Operation": "Led an anti-terrorist operation in Jammu and Kashmir, displaying exemplary bravery and making the supreme sacrifice.",
      "Param Vir Chakra": "Posthumously awarded India's highest military decoration for his outstanding courage."
    }
  },
  {
    "name": "Colonel Narendra 'Bull' Kumar",
    "imageurl": "https://www.bharat-rakshak.com/ARMY/images/Article43.jpg",
    "summary": "Colonel Narendra 'Bull' Kumar is a decorated officer of the Indian Army and a mountaineer. Known for his contributions to high-altitude and mountain warfare, he has led numerous expeditions, including the first successful Indian ascent of Mount Everest in 1965.",
    "events": {
      "Mount Everest Expedition": "Led the first successful Indian ascent of Mount Everest in 1965, showcasing his mountaineering and leadership skills.",
      "High-Altitude Warfare": "Contributed significantly to high-altitude and mountain warfare, imparting his knowledge and expertise to the armed forces."
    }
  },
  {
    "name": "Brigadier Kuldip Singh Chandpuri",
    "imageurl": "https://encrypted-tbn3.gstatic.com/images?q=tbn:ANd9GcSrifN1rTWZwNVbfH2ohThiZEtsiVxp4iSt1VGciqwotquc17l6",
    "summary": "Brigadier Kuldip Singh Chandpuri (22 November 1940 – 17 November 2018) was an officer in the Indian Army, best known for his leadership during the Battle of Longewala in the Indo-Pakistani War of 1971. His strategic acumen and determination in holding the post against overwhelming odds contributed to a decisive Indian victory.",
    "events": {
      "Battle of Longewala": "Led the defense of Longewala against a much larger Pakistani force, displaying exceptional strategic acumen.",
      "Maha Vir Chakra": "Awarded the Maha Vir Chakra for his leadership and courage during the Battle of Longewala."
    }
  },
  {
    "name": "Colonel M. B. Ravindranath",
    "imageurl": "https://www.honourpoint.in/wp-content/uploads/2018/04/Col-MB-Ravindranath-VrC.jpg",
    "summary": "Colonel M. B. Ravindranath, PVC, is a retired officer of the Indian Army and a recipient of the Param Vir Chakra, India's highest military decoration. His exceptional courage and leadership during the Battle of Shingo River in the Indo-Pakistani War of 1971 are etched in the annals of military history.",
    "events": {
      "Battle of Shingo River": "Led his troops with exceptional courage in the Battle of Shingo River, contributing to India's victory in the war.",
      "Param Vir Chakra": "Awarded India's highest military decoration for his outstanding bravery."
    }
  },
  {
    "name": "Major Sandeep Unnikrishnan",
    "imageurl": "https://ik.imagekit.io/j83rchiauw/A_List_Star/major-sandeep-unnikrishnan-tring.jpg",
    "summary": "Major Sandeep Unnikrishnan, Ashoka Chakra (15 March 1977 – 28 November 2008), was an officer in the Indian Army's elite National Security Guard (NSG). He displayed exceptional bravery during the 2008 Mumbai attacks and made the supreme sacrifice in the line of duty.",
    "events": {
      "2008 Mumbai Attacks": "Led the NSG operation during the 2008 Mumbai attacks, displaying extraordinary courage and sacrificing his life for the nation.",
      "Ashoka Chakra": "Posthumously awarded India's highest peacetime military decoration for his outstanding bravery."
    }
  }
]
